{"ArrayName":[{"reviewerID": "AKM1MP6P0OYPR", "asin": "0132793040", "reviewerName": "Vicki Gibson \"momo4\"", "helpful": [1, 1], "reviewText": "Corey Barker does a great job of explaining Blend Modes in this DVD. All of the Kelby training videos are great but pricey to buy individually. If you really want bang for your buck just subscribe to Kelby Training online.", "overall": 5.0, "summary": "Very thorough", "unixReviewTime": 1365811200, "reviewTime": "04 13, 2013"},
{"reviewerID": "A2CX7LUOHB2NDG", "asin": "0321732944", "reviewerName": "Bernie", "helpful": [0, 0], "reviewText": "While many beginner DVDs try to teach you everything there is to know about Photoshop CS5, this introductory course shows you the critical things you need to know to start feeling confident in your Photoshop skills. Bestselling author and Photoshop trainer, Matt Kloskowski shows you exactly what you need to know about tools, filters, adjustments, palettes, and menu items to hit the ground running in Photoshop. These include: layers and how they're key to mastering Photoshop, selections and the essential tools you really need to worry about, getting started with Camera Raw and which Retouching tools you'll find the most helpful. When you're done with this DVD you'll have a solid grasp of the most important features and be at the next level in no time.", "overall": 5.0, "summary": "Adobe Photoshop CS5 Crash Course with master Photoshop trainer, Matt Kloskowski", "unixReviewTime": 1341100800, "reviewTime": "07 1, 2012"},
{"reviewerID": "A2NWSAGRHCP8N5", "asin": "0439886341", "reviewerName": "bowmans2007", "helpful": [1, 1], "reviewText": "It never worked. My daughter worked to earn the money to get this and it never worked for her. I had to buy her a new one to replace it", "overall": 1.0, "summary": "absolutely horrible", "unixReviewTime": 1367193600, "reviewTime": "04 29, 2013"},
{"reviewerID": "A2WNBOD3WNDNKT", "asin": "0439886341", "reviewerName": "JAL", "helpful": [1, 1], "reviewText": "Some of the functions did not work properly. My daughter bought this with her own money and was disappointed that it did not function as advertised.", "overall": 3.0, "summary": "Disappointing", "unixReviewTime": 1374451200, "reviewTime": "07 22, 2013"},
{"reviewerID": "A1GI0U4ZRJA8WN", "asin": "0439886341", "reviewerName": "Truthfull", "helpful": [4, 4], "reviewText": "Do not waste your money on this thing it is terrible i boutght this product for my son and when i put in phone numbers for him to remember or the date and it would always reset then i would have to do it all over again i couldn't do anything about it it was getting very frustrating so we just threw it away DO NOT Absolutely DO NOT SPEND YOUR MONEY ON THIS", "overall": 1.0, "summary": "TERRIBLE DONT WASTE YOUR MONEY", "unixReviewTime": 1334707200, "reviewTime": "04 18, 2012"},
{"reviewerID": "A1QGNMC6O1VW39", "asin": "0511189877", "reviewerName": "CK", "helpful": [0, 0], "reviewText": "Dog got the old remote and destroyed it. Didn't feel like explaining to the folks at the Time Warner Cable office what happened. Saw the price on Amazon for this one and chose the low hassle option. It works perfectly. Price was right.", "overall": 5.0, "summary": "Works Great with my TWC box", "unixReviewTime": 1397433600, "reviewTime": "04 14, 2014"},
{"reviewerID": "A3J3BRHTDRFJ2G", "asin": "0511189877", "reviewerName": "EJ Honda \"ejhonda\"", "helpful": [1, 1], "reviewText": "This remote, for whatever reason, was chosen by Time Warner to replace their previous silver remote, the Time Warner Synergy V RC-U62CP-1.12S. The actual function of this CLIKR-5 is OK, but the ergonomic design sets back remotes by 20 years. The buttons are all the same, there's no separation of the number buttons, the volume and channel buttons are the same shape as the other buttons on the remote, and it all adds up to a crappy user experience. Why would TWC accept this as a replacement? This remote is virtually impossible to pick up and use without staring at it to make sure where your fingers are. Heck, you have to feel around just to figure out if you've grabbed it by the top or bottom, since there's no articulation in the body of the thing to tell you which end is up. Horrible, just horrible design. I'm skipping this and paying double for a refurbished Synergy V.", "overall": 2.0, "summary": "Ergonomic nightmare", "unixReviewTime": 1397433600, "reviewTime": "04 14, 2014"},
{"reviewerID": "A2TY0BTJOTENPG", "asin": "0511189877", "reviewerName": "Johnny Exx", "helpful": [0, 1], "reviewText": "We had an old Time Warner Cable remote that was dropped into a bucket of dirty mop water. We dried it out and it seemed to work &#34;fine&#34; except for the few times one of the batteries began to sizzle and smoke and became hotter than anything I had ever felt before and literally burned a hole in our couch upholstery. Needless to say, this remote, the CLIKR-5, is awesome, easily programmed, and works perfectly with our TWC equipment and all the other A/V components. I love this remote... great product. (Probably goes without saying, but just in case, you don't get the TWC logo on it.)", "overall": 5.0, "summary": "Excellent replacement to Time Warner Cable remote", "unixReviewTime": 1395878400, "reviewTime": "03 27, 2014"},
{"reviewerID": "A34ATBPOK6HCHY", "asin": "0511189877", "reviewerName": "Nancy C. Johnson", "helpful": [0, 0], "reviewText": "This unit works just like the TEC unit only better. I like it and would buy another if needed. OK?", "overall": 5.0, "summary": "Great piece", "unixReviewTime": 1395532800, "reviewTime": "03 23, 2014"},
{"reviewerID": "A89DO69P0XZ27", "asin": "0511189877", "reviewerName": "Stephen Schultz", "helpful": [0, 0], "reviewText": "It is an exact duplicate of my Time warner remote.I bought it so my wife could control the TV from her chair and not ask me to do it every time.It works great.I would reccomend it to anyone.", "overall": 5.0, "summary": "Time Warner cable remote", "unixReviewTime": 1395446400, "reviewTime": "03 22, 2014"},
{"reviewerID": "AZYNQZ94U6VDB", "asin": "0511189877", "reviewerName": "Terri L. Pittman", "helpful": [0, 1], "reviewText": "Works on my t.v. that no other remote works on. Was hard as heck to find a compatible one. Even works with my old blu ray player. Doesn't work with my old VCR but that thing is so old it would be like walking on water if it did.", "overall": 5.0, "summary": "Awesome", "unixReviewTime": 1401321600, "reviewTime": "05 29, 2014"},
{"reviewerID": "A1DA3W4GTFXP6O", "asin": "0528881469", "helpful": [0, 0], "reviewText": "Love it has everything I wanted any problems were quickly resolved", "overall": 5.0, "summary": "love it", "unixReviewTime": 1405641600, "reviewTime": "07 18, 2014"},
{"reviewerID": "A29LPQQDG7LD5J", "asin": "0528881469", "reviewerName": "Alfred Delgado", "helpful": [0, 0], "reviewText": "I have owned two Rand McNally GPS devices over the last two years. Buyer beware! They are pieces of junk. The software is great, but the hardware does not last. The first GPS lasted a year. I spent another $400, that one lasted about 14 months. If you don't mind spending $400 a year for a GPS buy one. Otherwise do not buy it it is the worst and most expensive piece of junk I have ever bought. I still use my original GARMIN I purchased in 2006.", "overall": 1.0, "summary": "Piece of Junk", "unixReviewTime": 1352073600, "reviewTime": "11 5, 2012"},
{"reviewerID": "AO94DHGC771SJ", "asin": "0528881469", "reviewerName": "amazdnu", "helpful": [0, 0], "reviewText": "We got this GPS for my husband who is an (OTR) over the road trucker. Very Impressed with the shipping time, it arrived a few days earlier than expected... within a week of use however it started freezing up... could of just been a glitch in that unit. Worked great when it worked! Will work great for the normal person as well but does have the \"trucker\" option. (the big truck routes - tells you when a scale is coming up ect...) Love the bigger screen, the ease of use, the ease of putting addresses into memory. Nothing really bad to say about the unit with the exception of it freezing which is probably one in a million and that's just my luck. I contacted the seller and within minutes of my email I received a email back with instructions for an exchange! VERY impressed all the way around!", "overall": 5.0, "summary": "Gotta have GPS!", "unixReviewTime": 1370131200, "reviewTime": "06 2, 2013"},
{"reviewerID": "AMO214LNFCEI4", "asin": "0528881469", "reviewerName": "Amazon Customer", "helpful": [12, 15], "reviewText": "I'm a professional OTR truck driver, and I bought a TND 700 at a truck stop hoping to make my life easier. Rand McNally, are you listening?First thing I did after charging it was connect it to my laptop and install the software and then attempt to update it. The software detected a problem with my update and wanted my home address so I could be sent a patch on an SD card. Hello? I don't think I'm all that unusual; my home address is a PO box that a friend checks weekly and that I might get to check every six months or so. I live in my truck and at truck stops. If you need to make a patch available on an SD card then you should send the SD cards to the truck stops where the devices are sold. I ran the update program multiple times until the program said that the TND 700 was completely updated.I programmed in the height (13'6\"), the length (53') and the weight (80,000#) of my rig and told it that I preferred highways. I was parked at a truck stop in the Cincinnati OH area. My next pickup was about 15 miles down the same freeway but on the other side of it a couple of blocks. My cell phone GPS (Sprint) said to get on the freeway to get to my pickup. The TND 700 routed me thru 23 miles of residential streets before finally getting me to my pickup. Very exciting, especially since every time I refused to turn down a street posted \"No Trucks\" the TND 700 took almost 5 minutes to figure a re-route, and it happened multiple times on that short trip.I decided to give it another chance. After my pickup on the north side of Cincinnati just off of I-75 I needed to head to Phoenix AZ via I-71. Easy route is to just hop on I-75 and drive west and south to the intersection of I-71. Indeed, that is what my cell phone advised. The TND 700, however, wanted to route me over surface streets across the city and pick up I-75 on the other side of the city. I turned it off and the next time I passed a truck stop of the same chain I purchased it at I returned it and got my money back.I then spent $30 on a cheap printer. Now I take a minute to set up my route on Google and print it out. Hasn't gotten me lost yet over several cross country trips.", "overall": 1.0, "summary": "Very Disappointed", "unixReviewTime": 1290643200, "reviewTime": "11 25, 2010"},
{"reviewerID": "A28B1G1MSJ6OO1", "asin": "0528881469", "reviewerName": "A. O Sandness", "helpful": [21, 22], "reviewText": "This is a great truck GPS. I've tried others and nothing seems to come close to the Rand McNally TND-700.Excellent screen size and resolution. The audio is loud enough to be heard over road noise and the purr of my Kenworth/Cat engine. I've used it for the last 8,000 miles or so and it has only glitched once. Just restarted it and it picked up on my route right where it should have. The exit lane screen has been spot on every time and gives me plenty of time to get my rig into the appropriate lane safely. I also love the multi-stop route planning and use it a lot. Updated regularly, it has shown me all the construction zones and has a feature to allow me to detour around them. Creating Groups and storing locations in them is a breeze so I can separate warehouse from store locations, etc.I'm running an HP Pavilion laptop with Windows 7 OS for the dock and update. The USB port DOES charge the GPS, at least with my laptop, despite the warning in a previous review. Even if it didn't, the supplied 12-volt and AC chargers take care of getting the battery up to speed.My complaints are relatively minor:Battery life when it is unplugged isn't great. However, since I use it plugged in in the cab 95% of the time, it doesn't create too much of a problem.The announcement of state borders coming up is nice but it doesn't tell you (or show you on the map display) what state you are in and/or going into. Again, a minor issue because I know where I am but all my other GPS units had this feature. For $500 smackers, I don't expect this kind of slip-up.There is a Micro SD slot on the unit and I bought a card for it. Unfortunately, the manual has absolutely no information on using it. The only reference is on the page showing the physical features of the unit, showing the position of the slot. Annoying.Clean up the minor issues and this unit rates a solid 5.Rand McNally 528881469 7-inch Intelliroute TND 700 Truck GPS", "overall": 4.0, "summary": "Great Unit!", "unixReviewTime": 1280016000, "reviewTime": "07 25, 2010"},
{"reviewerID": "A3N7T0DY83Y4IG", "asin": "0528881469", "reviewerName": "C. A. Freeman", "helpful": [43, 45], "reviewText": "Well, what can I say. I've had this unit in my truck for about four days now. Prior to that I had a Garmin 755T non-truck GPS. One of my favorite features in that unit was the ability to plan a route by determining mileage using the stop or via feature. What I would do is using a map I would route myself several different ways forcing the unit by putting in stops or vias at different locations along the route, otherwise, like most GPS 's, it determines what it thinks is the best route. I could add up to 10 Via's or stop points for each route and then based on mileage and other factors determine which is the best route to take. Multiple stops and the ability to route was the most important reason for having the Garmin. However it was not truck specific. And considering I am now hauling strictly hazmat I wanted something that would take that into consideration. After perusing various forums, review sites, and word-of-mouth my choices boiled down to the Garmin 465T or the RAND McNally Intelliroute TND 700. Even though it was quite a bit more than the Garmin I chose the TND 700 for several reasons. The main one being the extra screen size, and its ability to coordinate with the RAND McNally truck atlas and also its ease of updating.Now on to my first impression of the TND 700. It seems to be an aesthetically pleasing and durably built unit. The first thing I noticed was it's very slow to boot compared to my old Garmin. Whether this is unique to the TND 700 or is common amongst all truck specific gps units I cannot tell, but it's really not that big of a deal. The second thing I noticed was the overwhelming wealth of information put forth. That might explain why the manual (available via the TND dock) is well over 100 pages long..... There is somewhat of a learning curve with this unit. The next thing I noticed was the complexity of entering routes. As previously mentioned I like to force it into my preferred routing by the use of stops or vias. That was a big no go with this unit. While you can enter multiple stops or vias it is nowhere near as user-friendly as my old Garmin. Furthermore there is no way you can determine total mileage on the route that you have chosen, as I could with the Garmin. Totally flummoxed by what appeared to be an omission of one of the best routing tools a trucker could have I went online and verified through an expert source connected with RAND McNally that no, that feature was a couple updates down the line and was not available at this point. Unbelievable. Also forcing the unit to follow a specific route can be very challenging. For a unit of this price, and feature laden, I find this totally unacceptable. I am still mulling over selling this unit and buying the Garmin 465T. I really do like this GPS, the screen is magnificent, and the volume is awesome.Another thing I've noticed, which I do not think is unique to this unit, is some of the weird routing that it does. I've never owned a truck specific GPS before but after playing with this one for a couple of days I get the impression that what RAND MacNally (and the others that use Navteq) has done is take a plain old car specific Navteq map and a road atlas with truck restrictions and made notifications on the map. In most databases there is not a 100% thorough listing of every road in the country. What I mean is that this unit will route you down roads you don't belong on. Today while coming home it tried routing me on several 9 ton County roads. What that means is that a truck is limited to 73280 unless the road is posted at 10 tons. County roads do not have that restriction listed in the RAND McNally road atlas, so I believe that is why it is not listed..... Also unacceptable in a unit of this price and sold as truck specific. However I'd be willing to bet the other truck specific units are the same way as no one has ever done a truck specific version of NavTeq.Another bone I have to pick is the POI's. Not only the truck specific ones but the others all seem to be somewhat outdated. I think the Garmin, at least the ones that I have used, are more current. It would also be nice if I could add my own POI'sTo sum it up I will keep this unit a little longer to see if I can make it workable. If not I will go back to Garmin. I like the concept and I like the unit but at this point I'll have to say I am somewhat unimpressed.pros:Large screenterrific imagesoutstanding volumecons:inability to determine route mileage by multiple stops and viasa somewhat outdated POI information.Non-truck specific routings.Cost.", "overall": 3.0, "summary": "1st impression", "unixReviewTime": 1283990400, "reviewTime": "09 9, 2010"},
{"reviewerID": "A1H8PY3QHMQQA0", "asin": "0528881469", "reviewerName": "Dave M. Shaw \"mack dave\"", "helpful": [9, 10], "reviewText": "Not going to write a long review, even thought this unit deserves one. I've driven well over 1-mil miles and done most of my own routing so I pretty know whats the fastest and shortest. Have been using a basic garmin for the past three years and with ANY Gps unit they'll ALL get you in trouble if you let them. I was really excited about this unit, due to the size and the features. Allot of great grafics and on screen info thats usefull. But the most basic item that it was lacking was the gps tracking. I gave this unit allot of leadway on its mistakes due to the fact that it had allot of cool stuff that it did, but its ability to track you and route you was not even close to what the basic garmin could due. Its like the prossesor that they installed in the TND 700 was 10 years old. Example if I needed to make a simple route change I.E. in town down to the next street due to the fact that I couldn't make the turn or the street was blocked off, it would take the TND 700 upwards of 45 seconds to a minute and a half to reroute me. Here I'm sitting at a stop light waiting for directions and waiting that long with cars on my backside didn't make me happy. This is a problem that happened evertime you had to reroute, weather it was a simple street change or a major highway change. Also from the time you turned the unit on it would take twice as long to boot itself up. At least a dozen times with in a week it put me on the wrong roads and when I made a wrong turn it got it self lost....I.E. take left on xyz street, and it was some ones drive way. Or turn left in 800 yards and the turn was less than 10 feet away. You might think in a conjested city situation I might get a little mixed up, but this is out in the country. Twice it put me under 12'6\" bridges when I'm 13'6\". Of course I made sure all my truck setting where they were supposed to be. I also updated the OS version,via Rand McNally. All in all I expected alot out of this unit and got a unit that should of been field tested with some people that drive allot. It just had to many route mistakes. Going back to the basic garmin. This isn't just my complaints, I have three friends that bought the same unit and have the same complaints. All of us returned the units.", "overall": 2.0, "summary": "Great grafics, POOR GPS", "unixReviewTime": 1290556800, "reviewTime": "11 24, 2010"},
{"reviewerID": "A2CPBQ5W4OGBX", "asin": "0528881469", "reviewerName": "Dclownfish03 \"Dclownfish03\"", "helpful": [23, 32], "reviewText": "My brother is a trucker and pre-ordered this. He was out on the road when it arrived, so he asked me to charge it, update it, and play with it. FUN! I am not a trucker, but from what I hear from my brother, the tools on this device are awesome. It looks like it would be very helpful for him. The thing is huge, a 7\" screen! Overall, this seems to be a great tool.My problem with it is that it cannot update. I have a brand new computer running Windows 7 64 bit. It's a Dell Studio XPS 8100 (i5 processor). After reading on forums and contacting Rand McNally, I have learned that Windows 7 does not send enough power to the USB ports to allow the TND 700 to go into \"connected\" mode when it's plugged in to a computer. Supposedly this is a problem that occurs mostly with laptops and some Dell systems (\"Dell Latitude or Inspiron PC (it may occur on other models as well)\"). Rand McNally send a very helpful email with some solutions to the problem, though it sounds like they are still unsure of all fixes or what causes the problem. I am disappointed that a brand new device does not work with a brand new operating system, though that seems to be the nature of all things now-a-days. I am hoping that it will update on my brother's XP laptop. we'll see when he gets back home.", "overall": 2.0, "summary": "New GPS doesn't work with new Windows 7", "unixReviewTime": 1277078400, "reviewTime": "06 21, 2010"}]}
